{
  "hajj_data": [
    {
      "id": "1",
      "title": "Ihram",
      "content": "Ang kahulugan ng Ihram ay ang pagbibigay layunin sa pagsasagawa ng Hajj at Umrah. At ang literal na kahulugan nito ay dalalawang puting tela na isinusuot pantaas (rida) at pambaba (izar)."
    },
    {
      "id": "2",
      "title": "Mga dapat gawin bago pumunta sa Makkah upang magsagawa ng Umrah",
      "content": "⦁ Pangunahing kalinisan o kadalisayan:\n\n* Pag-aahit ng buhok sa maselang bahagi ng katawan.\n\n* Pag-ahit o pagbunot ng balahibo sa kilikili.\n\n* Pagputol ng kuko maging sa kamay at paa.\n\n* pag-gupit ng bigote at hayaan ang balbas.\n\n* GHUSUL (PAGPAPALIGO) kasama ang layunin na magsasagawa ng Umrah."
    },
    {
      "id": "3",
      "title": "Mga kinakailangang gawin pagdating sa Miqat",
      "content": "⦁ Sa pagsuot ng Ihram:\n\n* GHUSUL (o WUDHU kasama na dito ang paligo ng buong katawan at paggamit ng shampoo at sabon).\n\n* Isuot ang Ihram 'RIDA' (pang itaas na kasuotan) 'IZAR' (pang ibaba na kasuotan) na nakabalabal sa katawan at walang pang loob (brief) o kahit anong saplot na may tahi.\n\n* Maglagay ng pabango (oil-based) sa katawan lamang (huwag sa ihram)."
    },
    {
      "id": "4",
      "title": "Ang layunin para isagawa ang Umrah",
      "content": "⦁ Kinakailangan mong banggitin ang sumusunod:\n\n\"Labbaik allahuma Umrah\"\n\nito ang layunin o talbiya sa umrah.\n\n⦁ Bigkasin ang Talbiya ng malakas (para sa kalalakihan) at (mahina lamang para sa mga kababaihan) hanggang sa makita ang Ka’bah sa loob ng masjid Al haram:\n\n\"Labbaik allahuma labbaik, labbaik la shareeka laka labbaik, Innalhamda Wanna’mata laka wal mulk la shareeka lak.\""
    },
    {
      "id": "5",
      "title": "Ang mga ipinag babawal matapos magkaroon ng layunin",
      "content": "* Pagtanggal o pag-ahit ng buhok sa mukha o katawan.\n\n* Pagputol ng kuko sa kamay at paa.\n\n* Pagtakip sa ulo.\n\n* Paglagay ng pabango sa katawan o sa Ihram.\n\n* Iwasan ang pagamit ng sabon (na mayroong pabango)."
    },
    {
      "id": "6",
      "title": "Tawaf",
      "content": "Ang Tawaf ay ang pag-ikot ng pitong beses sa Ka'bah\nBigkasin ang du’a at ihakbang ang kanang paa sa pagpasok sa masjid Al-Haram.\n\"Bismillah wasalatu wassalam Ala Rasulillah, Allahuma iftah liy abwaba rahmatik.\"\n\nAyusin ang rida (pang itaas na kasuotan ) na nakalabas ang kanang balikat (Ithiba).\n\n⦁ Magsagawa ng Tawaf na kung saan ang Ka'bah ay nasa kaliwang bahagi ng Hajji habang nagta-Tawaf.\n\n⦁ Ang Tawaf ay binubuo ng pitong pag-ikot magmula sa Black stone (Hajer Al Aswad) at nagtatapos din dito. Humarap sa Ka’bah at nakataas ang kanang kamay na nakaharap sa Black Stone at bigkasin ang:\n\"Bismillah Allahu Akbar”\npara sa unang pag-ikot at\n\"Allahu Akbar\"\npara sa pangalawa hanggang sa pang pitong ikot.\n\n⦁ Pagdating sa kanto ng Yamani, banggitin ang du’a:\n\"Rabbana atina fi dunya hassana wa fil akhirati hassana waqina adhab'ban nar\".\n\nMagsagawa ng (2) dalawang raka’a sa likod ng Maqam Ibrahim (o kahit saang bahagi sa loob ng Masjid Al-Haram). Mas mainam na gamitin ang surah Al-Fatiha at surah Al-Kafirun sa unang rak'at at surah Al-Fatiha at surah Al-Ikhlas sa pangalawang rak'at. Uminom ng tubig Zam-zam (maliban sa mga nag-aayuno)."
    },
    {
      "id": "7",
      "title": "Sa'i",
      "content": "Ito ay ang paglalakad papunta at pabalik sa pagitan ng Safa at Marwah.\n\n⦁ Tahakin ang daan papuntang Safa habang binibigkas ang sumusunod:\n\n\"Innas Safa wal Marwah min sha’a iri llahi faman Hajja Al-Bayta aw ‘atamara fala junaha alaihi an yattawaafa bihima wa man tattawwa’a khairan fa inna llaha shakirun alim.\"\n\nhumarap sa direksiyon ng ka’bah at itaas ang mga kamay na ang mga palad ay nakaharap sa itaas at bikasin ang mga sumusunod:\n\n\"Allahu akbar, Allahu akbar, Allahu akbar. La Ilaha Ilallah wahdahu laa sharika la Lahul mulku walahulhamdu wa huwa ala kulli shay’in Qadir\" 3X.\n\nMagmula sa bundok ng Safa hanggang sa bundok ng Marwa ay (1) isang bilang. Bigkasin at magsagawa ng du’a tuwing sasapit sa magkabilang bundok maliban sa huling pag-ikot na magtatapos sa bundok ng Marwa.\n\n⦁ Ang tumakbo sa loob ng dalawang berdeng guhit na madaraanan sa pagitan ng dalawang burol. Ang mga babae, matatanda at may mga sakit ay ininiliban sa pagtakbo.\n\n⦁ Magpagupit o magpaahit ng buhok. (sa mga nagsasagawa ng Hajj ang pagpapaahit ay ipinagpaliban at isagawa sa araw ng ritwal ng Hajj)."
    },
    {
      "id": "8",
      "title": "Ika-8 araw ng Dhul Hijjah",
      "content": "(IHRAM)\n\n⦁ Ang ika-8 ng Dhul Hijja ay tinatawag na Yawmo Tarwiya.\n\n⦁ Sa umaga ng araw na iyon, ang mga magsasagawa ng hajj ay magsusuot ng ihram sa mga lugar kung saan sila naroroon at ilagay sa isipan ang layunin para magsagawa ng hajj.\n\n⦁ Ang taong Mutamatte (yaong nagtatanggal ng ihram) ay maliligo, magputol ng kuko, maggupit ng bigote at mag-ahit ng mga balahibo sa maselang bahagi ng katawan. Pagkatapos ang mga kalalakihan ay magsuot ng Ihram (izar at rida) samantala ang mga kababaihan ay malayang pumili ng damit na nais isuot maliban sa guwantes (gloves) at takip sa mukha.\n\n⦁ Ang mga taong hindi nagtanggal ng ihram tulad ng Qareen at Mufred ay hindi na kinakailangan pang gawin ang tulad ng ginawa ng Mutamatte.\n\n⦁ Bigkasin ang ”LABBAIKA HAJJAN” ito ang tinatawag na layunin o talbiya sa hajj.\n\n⦁ Kung ang isang tao ay nangangamba sa isang bagay na maaaring pumigil sa kanya sa pagsasagawa ng Hajj. Nararapat na bigkasin niya ang\n\n\"EN HABASANEY HAABESON FAMA HALLEY HAITHU HABASATNEY\"\n\nna ang kahulugan ay “kung mayroon mang isang bagay na makapag pipigil sa akin sa pagsagawa ko ng Hajj ay hanggang doon lamang ang aking ihram,nguni't kung wala siyang kinatatakutan ay hindi na kailangan.”\n\n⦁ Ang mga tao sa araw na ito ay magtutungo sa Mina, kasabay ang pagbibigkas ng talbiya doon isasagawa ang mga dasal na Dhuhur,Asr, Magrib, E’isha at Fajr ang bawat salah ay ginagawa sa takdang oras subalit ang apat na raka’t (unit) ay pinapaiksi ng tigdalawang raka't.\n\n⦁ Sa pagkakataong ito, kinakailangan ang madalas na pagbigkas ng TALBIYAH:\n\nLABBAYK ALLAHUMMA LABBAYK, LABBAYK LAA SHAREEKA LAKA LABBAYK, INNAL HAMDAH WA NI’MATA LAKA WAL MULK, LAA SHAREEKA LAK.\n\nAng pagbigkas ng Talbiah ay mananatili hanggang sa araw na ika-10 ng Dhulhijjah. Ito ay ititigil pagkatapos ng pagbabato sa Jamaratul Aqabah sa araw na iyon."
    },
    {
      "id": "9",
      "title": "Ika-9 araw ng Dhul Hijjah",
      "content": "(WUKUF AL ARAFA)\n\n⦁ Magtungo sa Arafat at tiyakin na ikaw ay nasa lugar na sakop nito, dahil ang wadi urna ay hindi na nito nasasakupan. Magpuri at manalangin sa Allah ng ibat-ibang uri ng panalangin.\n\n⦁ Ang buong lugar ng Arafat ay Muaqeef ngunit hindi na kinakailangan na umakyat pa sa itaas ng bundok.\n\n⦁ Humarap sa Quibla sa tuwing mananalangin at itaas ang dalawang kamay na ang mga palad ay nakaharap sa itaas. Manalangin ng taimtim sa Allah hanggang sa paglubog ng araw.\n\n⦁ Palaging bigkasin ang panalanging ito:\n\n\"LA ILAHA ILLALLAH WAHDAHU LA SHARIKA LAH, LAHUL MULKO WA LAHUL HAMDU WA HUWA ALA KULI SHAY’IN QADEER”.\n\nHuwag umalis sa arafat hanggang hindi pa lumulubog ang araw. Paglubog ng araw ay lisanin ang arafat patungong Muzdalifa. Pagdating sa musdalifa ay isagawa ang Salah ng Maghrib at E’isha na pinagsama at pinaiksi, subalit ang Maghrib ay tatlong raka’t pa rin. Matulog ng maaga hanggang sumapit ang Fajr, subalit ang mga matatanda at mga kababaihan ay pinahihintulutang lisanin ang Musdalifa at magtungo sa Mina paglipas ng hating gabi."
    },
    {
      "id": "10",
      "title": "Ika-10 araw ng Dhul Hijjah",
      "content": "(TAWAF-SA’I)\n\n⦁ Isagawa ang salatul Fajr sa Muzdalifa maliban sa mga kababaihan at matatanda dahil sila ay pinahihintulutang lumisan ng maaga.\n\n⦁ Matapos ang salatul Fajr ay humarap sa Quibla, magpuri at manalangin sa Allah hanggang sa lumaganap ang liwanag sa buong paligid.\n\n⦁ Bago sumikat ang araw lisanin ng mapayapa ang Muzdalifa patungong Mina habang binibigkas ang talbiya.\n\n⦁ Mamulot ng pitong maliliit na bato, saan mang dako ng daan sa Muzdalifa patungong Mina.\n\n⦁ Matapos ang mga unang nabanggit ay kailangang gawin ang mga sumusunod\n\n⦁ Pagdating sa Jamarat itigil ang pagbigkas ng talbiya, batuhin ang Jamaratul aqabah ng (7) pitong sunod-sunod na bato na tuwing ipupukol ay binibigkas ang \"ALLAHU AKBAR\" pagkatapos ay mag-alay ng Hadie, kumain mula sa alay at ang iba ay ipamahagi sa mahihirap. Ito ay dapat gawin ng mga taong nagsasagawa ng Hajj tamatto.\n\n⦁ Magpaahit o magpagupit ng buhok subalit ang pagahit ay mas mainam at malaki ang gantimpala mula sa Allah. Ang mga kababaihan ay puputulan lamang ng kaunti ang kanilang buhok. Sa pagkakataong ito ay sumapit kana sa tahalul awwal, pwede ka nang manumbalik sa dating kasuotan o maglagay ng pabango at malaya mo ng magagawa ang mga ipinagbabawal noong ikaw ay nakasuot ng Ihram maliban sa pakikipagtalik sa asawa. Makakamtam mo ang Tahalul awwal matapos mong isagawa ang dalawa mula sa tatlong ito.(Pagbato, Pagpapaahit at Pag-tawaf).\n\n⦁ Magtungo sa Makkah at magsagawa ng Tawwaful Ifadah, hindi na kinakailangan ang ram’el (paglakad ng mabilis) mag salah ng sunnah (2) dalawang raka’t isagawa ang Sa’i sa pagitan ng Safa at Marwa ang Mutamatte sa pagkakataong ito ay sumapit na sa Tahalul kam’el."
    },
    {
      "id": "11",
      "title": "Ika-11 araw ng Dhul Hijjah",
      "content": "⦁ Ang araw na ito ay tinatawag na ”Ayyawmo Tashreeq” Sunnah ang palagiang pagbigkas ng Takbir pagkatapos ng bawat salah. Ito ay bibigkasin din sa lahat ng pook. Manatili sa mina at isagawa ang limang dasal ng Jama’a subalit pinaiksi.\n\n⦁ Batuhin ang tatlong Jamarat paglipas ng salatul Dhuhur, magsimula sa maliit na Jamarat (Al-sugra) isunod ang nasa gitna (Al-wusta) at matatapos sa pinakamalaki (Al-aqaba). Batuhin ang bawat Jamarat ng (7) pitong sunod-sunod na bato na tuwing ipupukol ay binibigkas ang \"ALLAHU AKBAR\" ang mga batong gagamitin ay maaring pulutin saan mang dako sa lugar ng Mina.\n\n⦁ Matapos batuhin ang maliit na Jamarat sa katayuan na ang Makkah ay nasa gawing kaliwa at ang Mina ay nasa gawing kanan. Matungo sa dakong kanan at humarap sa Quibla, itaas ang mga kamay at manalangin sa Allah ng matagal tulad ng ginawa ni propeta Muhammad.\n\n⦁ Muling isagawa ang pagbato sa gitnang Jamarat (Al-Wusta) at pagkatapos ay magtungo naman sa dakong kaliwa, humarap sa Quiblah magpuri at manalangin ng matagal sa Allah.\n\n⦁ Matapos isagawa ang pagbato sa pinakamalaking Jamarat (Al-Aqabah) lisanin ang lugar at hindi na kailangang manalangin pa doon.\n\n⦁ Matapos isagawa ang pag-bato sa araw na iyon, kailangang manatili pa rin sa Mina."
    },
    {
      "id": "12",
      "title": "Ika-12 araw ng Dhul Hijjah",
      "content": "⦁ Matapos ang pag-papalipas ng gabi sa Mina samantalahin ang pagkakataon sa pagsasagawa ng mga mabubuting gawain at sa mga papuri sa Allah.\n\n⦁ Paglipas ng salatul Dhuhur simulan muli ang pagbato sa Jamarat na katulad sa pamamaraan noong ika 11 ng Dhul Hijja, unahin ang maliliit, isunod ang nasa gitna at pagkatapos sa pinakamalaking Jamarat.\n\n⦁ Para sa mga nagmamadali, matapos isagawa ang pagbato sa araw na ito ay maaari na nilang lisanin ang Mina bago lumubog ang araw at isagawa ang Tawaful Wedaa. Ang pananatili sa Mina hanggang ika-13 ng Dhul Hijja upang isagawa ang pagbabato sa Jamarat ay itinatagubilin dahil ganito ang ginawa ni Propeta Muhammad."
    },
    {
      "id": "13",
      "title": "Ika-13 araw ng Dhul Hijjah",
      "content": "⦁ Pag-lipas ng magdamag sa Mina hanggang sa muling matapos ang salatul dhuhur ay muling isagawa ang pagbato sa Jamarat na katulad na isinasagawa noong nakalipas na dalawang araw. Kung lubos na ang iyong pasiya na bumalik sa iyong bayan ay isagawa mo ang Tawwaful wedda, subalit ang mga kababaihan na kapapanganak pa lamang at iyong inabot ng buwanang dalaw ay hindi na kinakailangang magsagawa nito."
    },
    {
      "id": "14",
      "title": "Panalangin sa paglalakbay",
      "content": "Allahu Akbar, Allahu Akbar, Allahu Akbar\n\nSubhanal ladhee sakhara lanaa hadha\n\nWa maa kun’na lahoo muqrineen\n\nWa innaa ilaa rabbina lamun Qaliboon\n\nAllahumma in’naa nas’aluka fee safarinaa haadhaa\n\nAlbir-ra wat taqwa\n\nWa minal amali ma tardaa\n\nAllahumma haw’win alynaa safaranaa hadha\n\nWatwi an’naa bu’dah\n\nAllahumma in’nee a’udhu bika min wa’thais safar\n\nWa ka’abatil mandar\n\nWa so’il munqalabi l maali wal ahli"
    },
    {
      "id": "15",
      "title": "Disclaimer",
      "content": "Ang tanging layunin ng app na ito ay makapagbahagi ng Kaalaman. Wala kaming binagong anuman mula sa orihinal na aklat. Tanging ang layout lamang ang aming binago upang bumagay ito sa layout ng application."
    }
  ]
}